In [1]:
import psycopg2

In [2]:
import pandas as pd
import sqlalchemy
import matplotlib.pyplot as plt
import os

In [3]:
from dotenv import load_dotenv

load_dotenv()

True

In [4]:
from sqlalchemy import create_engine

# Postgres username, password, and database name
POSTGRES_USERNAME = os.getenv("ENV_USERNAME")  ## CHANGE THIS TO YOUR PANOPLY/POSTGRES USERNAME
POSTGRES_PASSWORD = os.getenv("ENV_PASSWORD") ## CHANGE THIS TO YOUR PANOPLY/POSTGRES PASSWORD POSTGRES_DBNAME = 'database' ## CHANGE THIS TO YOUR DATABASE NAME
POSTGRES_ADDRESS = os.getenv("ENV_ADDRESS")  ## INSERT YOUR DB ADDRESS IF IT'S NOT ON PANOPLY
POSTGRES_PORT = os.getenv("ENV_PORT") 
POSTGRES_DBNAME = 'birds'
# A long string that contains the necessary Postgres login information
postgres_str = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'
                .format(username=POSTGRES_USERNAME,
                        password=POSTGRES_PASSWORD,
                        ipaddress=POSTGRES_ADDRESS,
                        port=POSTGRES_PORT,
                        dbname=POSTGRES_DBNAME))
# Create the connection
engine = create_engine(postgres_str)
cnx = engine.connect()

In [5]:
birds = pd.read_sql_query('''SELECT * FROM birds_table;''', cnx)

In [8]:
birds_df = birds.copy()

In [9]:
birds_df.info

<bound method DataFrame.info of         english_name         country  latitude  longitude   id
0     Common Redpoll          Poland   50.7932    15.4995    1
1     Common Redpoll          Poland   50.7932    15.4995    2
2     Common Redpoll     Netherlands   52.8176     6.4326    3
3      Marsh Warbler  United Kingdom   60.3539    -1.2689    4
4      Marsh Warbler  United Kingdom   60.3539    -1.2689    5
..               ...             ...       ...        ...  ...
95    European Robin  United Kingdom   55.9937    -3.5605   96
96  Common Chaffinch  United Kingdom   51.5676     0.0451   97
97  Common Chaffinch  United Kingdom   49.9172    -6.3034   98
98  Common Chaffinch  United Kingdom   54.1245    -0.5722   99
99     Eurasian Coot     Netherlands   52.2962     5.1231  100

[100 rows x 5 columns]>

In [11]:
del birds_df['id']

In [12]:
birds

        english_name         country  latitude  longitude   id
0     Common Redpoll          Poland   50.7932    15.4995    1
1     Common Redpoll          Poland   50.7932    15.4995    2
2     Common Redpoll     Netherlands   52.8176     6.4326    3
3      Marsh Warbler  United Kingdom   60.3539    -1.2689    4
4      Marsh Warbler  United Kingdom   60.3539    -1.2689    5
..               ...             ...       ...        ...  ...
95    European Robin  United Kingdom   55.9937    -3.5605   96
96  Common Chaffinch  United Kingdom   51.5676     0.0451   97
97  Common Chaffinch  United Kingdom   49.9172    -6.3034   98
98  Common Chaffinch  United Kingdom   54.1245    -0.5722   99
99     Eurasian Coot     Netherlands   52.2962     5.1231  100

[100 rows x 5 columns]

In [13]:
birds_df

        english_name         country  latitude  longitude
0     Common Redpoll          Poland   50.7932    15.4995
1     Common Redpoll          Poland   50.7932    15.4995
2     Common Redpoll     Netherlands   52.8176     6.4326
3      Marsh Warbler  United Kingdom   60.3539    -1.2689
4      Marsh Warbler  United Kingdom   60.3539    -1.2689
..               ...             ...       ...        ...
95    European Robin  United Kingdom   55.9937    -3.5605
96  Common Chaffinch  United Kingdom   51.5676     0.0451
97  Common Chaffinch  United Kingdom   49.9172    -6.3034
98  Common Chaffinch  United Kingdom   54.1245    -0.5722
99     Eurasian Coot     Netherlands   52.2962     5.1231

[100 rows x 4 columns]

In [14]:
birds_df.to_sql('birds_df', con=engine, if_exists='append', index=False)